<h2>Importing required Library</h2>

In [11]:
import psycopg2     #this library for communicate with Postgres
import pandas as pd  # this library for data manipulation

<h2>Create Connection to the database (Postgres)</h2>

In [49]:
def create_database():
    # connectiong with default database inorder to create new database
    conn = psycopg2.connect("host=127.0.0.1 dbname=postgres user=postgres password=root")
    conn.set_session(autocommit=True)
    cursor = conn.cursor()
    
    #creating new database
    cursor.execute("CREATE DATABASE information")
    
    #close connection
    conn.close()
    
    #connection with new database
    conn = psycopg2.connect("host=127.0.0.1 dbname=information user=postgres password=root")
    conn.set_session(autocommit=True) # we don't need to bother with commit each transaction.
    cursor = conn.cursor()
    
    return cursor, conn

In [ ]:
def drop_tables(cursor,conn):
    for query in drop_table_queries:
        cursor.execute(query)

In [ ]:
def create_tables(cursor,conn):
    for query in create_table_queries:
        cursor.execute(query)

<h2>Here we are Reading CSV File</h2>

In [15]:
countries = pd.read_csv("E:\Projects\countries.csv")

In [21]:
countries.head()

,id,name,iso3,iso2,numeric_code,phone_code,capital,currency,currency_name,currency_symbol,tld,native,region,subregion,timezones,latitude,longitude,emoji,emojiU
0,1,Afghanistan,AFG,AF,4,93,Kabul,AFN,Afghan afghani,ÿã,.af,ÿßŸÅÿ∫ÿßŸÜÿ≥ÿ™ÿßŸÜ,Asia,Southern Asia,"[{zoneName:'Asia\/Kabul',gmtOffset:16200,gmtOf...",33.000000,65.0,üá¶üá´,U+1F1E6 U+1F1EB
1,2,Aland Islands,ALA,AX,248,+358-18,Mariehamn,EUR,Euro,‚Ç¨,.ax,√Öland,Europe,Northern Europe,"[{zoneName:'Europe\/Mariehamn',gmtOffset:7200,...",60.116667,19.9,üá¶üáΩ,U+1F1E6 U+1F1FD
2,3,Albania,ALB,AL,8,355,Tirana,ALL,Albanian lek,Lek,.al,Shqip√´ria,Europe,Southern Europe,"[{zoneName:'Europe\/Tirane',gmtOffset:3600,gmt...",41.000000,20.0,üá¶üá±,U+1F1E6 U+1F1F1
3,4,Algeria,DZA,DZ,12,213,Algiers,DZD,Algerian dinar,ÿØÿ¨,.dz,ÿßŸÑÿ¨ÿ≤ÿßÿ¶ÿ±,Africa,Northern Africa,"[{zoneName:'Africa\/Algiers',gmtOffset:3600,gm...",28.000000,3.0,üá©üáø,U+1F1E9 U+1F1FF
4,5,American Samoa,ASM,AS,16,+1-684,Pago Pago,USD,US Dollar,$,.as,American Samoa,Oceania,Polynesia,"[{zoneName:'Pacific\/Pago_Pago',gmtOffset:-396...",-14.333333,-170.0,üá¶üá∏,U+1F1E6 U+1F1F8

<h2>Removing extra columns</h2>

In [25]:
countries_clean = countries[['id', 'name', 'iso2', 'phone_code', 'capital','currency', 'currency_name', 'currency_symbol', 
                             'native','region', 'timezones', 'latitude', 'longitude']]

In [26]:
countries_clean.head(2) # checking for data reside in python object or not...

,id,name,iso2,phone_code,capital,currency,currency_name,currency_symbol,native,region,timezones,latitude,longitude
0,1,Afghanistan,AF,93,Kabul,AFN,Afghan afghani,ÿã,ÿßŸÅÿ∫ÿßŸÜÿ≥ÿ™ÿßŸÜ,Asia,"[{zoneName:'Asia\/Kabul',gmtOffset:16200,gmtOf...",33.000000,65.0
1,2,Aland Islands,AX,+358-18,Mariehamn,EUR,Euro,‚Ç¨,√Öland,Europe,"[{zoneName:'Europe\/Mariehamn',gmtOffset:7200,...",60.116667,19.9

In [27]:
states = pd.read_csv("E:\Projects\states.csv")

In [28]:
states.head()

,id,name,country_id,country_code,country_name,state_code,type,latitude,longitude
0,3901,Badakhshan,1,AF,Afghanistan,BDS,NaN,36.734772,70.811995
1,3871,Badghis,1,AF,Afghanistan,BDG,NaN,35.167134,63.769538
2,3875,Baghlan,1,AF,Afghanistan,BGL,NaN,36.178903,68.745306
3,3884,Balkh,1,AF,Afghanistan,BAL,NaN,36.755060,66.897537
4,3872,Bamyan,1,AF,Afghanistan,BAM,NaN,34.810007,67.821210

In [30]:
# Removing unneccesary columns from states object
states_clean = states[['id', 'name', 'country_id', 'country_code', 'country_name', 'state_code',  'latitude', 'longitude']]

In [31]:
states_clean.head(1)

,id,name,country_id,country_code,country_name,state_code,latitude,longitude
0,3901,Badakhshan,1,AF,Afghanistan,BDS,36.734772,70.811995

In [32]:
cities = pd.read_csv("E:\Projects\cities.csv")

In [33]:
cities.head()

,id,name,state_id,state_code,state_name,country_id,country_code,country_name,latitude,longitude,wikiDataId
0,52,AshkƒÅsham,3901,BDS,Badakhshan,1,AF,Afghanistan,36.68333,71.53333,Q4805192
1,68,Fayzabad,3901,BDS,Badakhshan,1,AF,Afghanistan,37.11664,70.58002,Q156558
2,78,Jurm,3901,BDS,Badakhshan,1,AF,Afghanistan,36.86477,70.83421,Q10308323
3,84,Khand≈´d,3901,BDS,Badakhshan,1,AF,Afghanistan,36.95127,72.31800,Q3290334
4,115,RƒÅghistƒÅn,3901,BDS,Badakhshan,1,AF,Afghanistan,37.66079,70.67346,Q2670909

In [34]:
cities.columns

Index(['id', 'name', 'state_id', 'state_code', 'state_name', 'country_id',
       'country_code', 'country_name', 'latitude', 'longitude', 'wikiDataId'],
      dtype='object')

In [37]:
# Removing unneccesary columns from cities object
cities_clean = cities[['id', 'name', 'state_id','country_id']]

In [132]:
cities_clean.head(3)

   id       name  state_id  country_id
0  52  AshkƒÅsham      3901           1
1  68   Fayzabad      3901           1
2  78       Jurm      3901           1

<h2>call the function for create database</h2>

In [50]:
cursor,conn = create_database()

<h2>Creating new tables</h2>

In [51]:
create_country_table = ("""CREATE TABLE IF NOT EXISTS countries(id int PRIMARY KEY, name VARCHAR, iso2 VARCHAR, phone_code VARCHAR,capital VARCHAR,currency VARCHAR,currency_name VARCHAR,currency_symbol VARCHAR,region VARCHAR,native VARCHAR,timezones VARCHAR,latitude VARCHAR,longitude VARCHAR)""")
cursor.execute(create_country_table)

In [52]:
create_state_table = ("""CREATE TABLE IF NOT EXISTS states(id INT PRIMARY KEY,country_id INT,name VARCHAR,country_code VARCHAR,country_name VARCHAR,state_code VARCHAR,latitude VARCHAR,longitude VARCHAR,
CONSTRAINT fk_country
FOREIGN KEY(country_id)   
REFERENCES countries(id) ON DELETE CASCADE)""")
cursor.execute(create_state_table)

In [2]:
create_cities_table = ("""CREATE TABLE IF NOT EXISTS cities(id INT PRIMARY KEY,country_id INT,name VARCHAR,state_id INT,
CONSTRAINT fk_country
FOREIGN KEY(country_id)   
REFERENCES countries(id) ON DELETE CASCADE,
CONSTRAINT fk_state
FOREIGN KEY(state_id)   
REFERENCES states(id) ON DELETE CASCADE)""")
cursor.execute(create_cities_table)

<h2>Inserting values from python object to Postgres</h2>

In [142]:
countries_insertion = ("""INSERT INTO countries(id,name,iso2,phone_code,capital,currency,currency_name,currency_symbol,region,native,timezones,latitude,longitude) 
                                        VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)""")

In [145]:
for i,row in countries_clean.iterrows():
    cursor.execute(countries_insertion, list(row))
#     print(row)

In [79]:
states_insertion = ("""INSERT INTO states(id,name,country_id,country_code,country_name,state_code,latitude,longitude) 
                                        VALUES(%s,%s,%s,%s,%s,%s,%s,%s)""")

In [80]:
for i,row in states_clean.iterrows():
    cursor.execute(states_insertion, list(row))
#     print(row)

In [99]:
cities_insertion = ("""INSERT INTO cities(id,name,country_id,state_id) 
                                        VALUES(%s,%s,%s,%s)""")

In [146]:
for i,row in cities_clean.iterrows():
    cursor.execute(cities_insertion,list(row))
#     print(row)

<h1>Done!! </h1>
<h2>In this project, we capture the data from CSV file, transform or clean it with panda library and finally dump that data into Postgrey database</h2>